docs/posts/2025-08-10-inserting-bible-text-with-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Aug 10, 2025 16:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inserting Bible Passages With Emacs</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Inserting Bible Passages With Emacs
<br />
<span class="subtitle">Aug 10, 2025 15:23</span>
</h1>
<p>
Much of my writing requires quoting biblical passages, which always involved opening another application, searching for the passage, copying and pasting, then cleaning up the pasted text. Here is a function that I now use to automate the process in Emacs. My preferred translation is the New Revised Standard Version, which is available online using the <a href="https://bible.oremus.org">oremus Bible Browser</a>. They have a convenient API which is documented <a href="https://bible.oremus.org/api.html">here</a>. The function asks for a passage reference, formats the inputted string properly for the API, retrieves the passage, strips the HTML, then inserts the resulting plain text. The passage can either be an entire chapter or selected verses from a chapter. If preferred, The book name can be abbreviated using the standard abbreviations. 
</p>

<p>
Here is the function:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(<span class="org-keyword">defun</span> <span class="org-function-name">nrsv-insert-passage</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">setq</span> oremus-passage (read-string <span class="org-string">"Passage: "</span>))
  (<span class="org-keyword">setq</span> oremus-passage (s-replace <span class="org-string">" "</span> <span class="org-string">"%20"</span> oremus-passage))
  (<span class="org-keyword">setq</span> oremus-link (concat <span class="org-string">"https://bible.oremus.org/?version=NRSV&amp;passage="</span> oremus-passage <span class="org-string">"&amp;vnum=NO&amp;fnote=NO&amp;omithidden=YES"</span>))
  (switch-to-buffer (url-retrieve-synchronously oremus-link))
  (beginning-of-buffer)
  (search-forward <span class="org-string">"passageref\"&gt;"</span>)
  (kill-region (point) 1)
  (search-forward <span class="org-string">"&lt;/div&gt;&lt;!-- class=\"bibletext\" --&gt;"</span>)
  (beginning-of-line)
  (kill-region (point) (point-max))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&lt;p&gt;"</span> nil t)
    (replace-match <span class="org-string">"\n"</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&lt;!.+?-&gt;"</span> nil t)
    (replace-match <span class="org-string">""</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&lt;.+?&gt;"</span> nil t)
    (replace-match <span class="org-string">""</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&amp;nbsp;"</span> nil t)
    (replace-match <span class="org-string">" "</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&amp;#147;"</span> nil t)
    (replace-match <span class="org-string">"\""</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&amp;#148;"</span> nil t)
    (replace-match <span class="org-string">"\""</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&amp;#145;"</span> nil t)
    (replace-match <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">'"</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&amp;#146;"</span> nil t)
    (replace-match <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">'"</span>))
  (beginning-of-buffer)
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"&amp;#151;"</span> nil t)
    (replace-match <span class="org-string">"---"</span>))
  (delete-extra-blank-lines)
  (clipboard-kill-ring-save (point-min) (point-max))
  (kill-buffer)
  (yank))
</code></pre>
</div>

<p>
If another translation is preferred, there are other sites that also have API&rsquo;s. I have to add my usual disclaimer &mdash; I really don&rsquo;t know what I&rsquo;m doing; I just keep messing with it until I get the result I wanted. Surely, there are more elegant ways of solving the problem, and I&rsquo;d welcome hearing about them. This is definitely the sort of thing that will be useful to only a handful of people in the world, if that. It is, however, an example of how useful Emacs can be, even for those of us non-programming types.
</p>

<div class="tagline" id="org14d9983">
<p>
Tagged:  <a href="../tags/emacs.html">Emacs</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Aug 10, 2025 16:33.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
